Revit 2026 API

# XYZAdd Method

---

Adds the specified vector to this vector and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Add(
	XYZ source
)
```
```vb
Public Function Add (
	source As XYZ
) As XYZ
```
```cpp
public:
XYZ^ Add(
	XYZ^ source
)
```
```fsharp
member Add :
        source : XYZ -> XYZ
```

#### Parameters

source XYZ
    The vector to add to this vector.

#### Return Value

XYZThe vector equal to the sum of the two vectors.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

The added vector is obtained by adding each coordinate of the specified vector to the corresponding coordinate of this vector.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace